mateeeeeee/Adria-DX12/Adria/Rendering/PSOCache.cpp
#include "PSOCache.h"
#include "ShaderCache.h"
#include "../Graphics/GraphicsDeviceDX12.h"
#include "../Graphics/GraphicsStates.h"
#include "../Graphics/ShaderCompiler.h"
#include "../Logging/Logger.h"
#include "../Utilities/Timer.h"
#include "../Utilities/HashMap.h"

namespace adria
{
	namespace
	{
		GraphicsDevice* gfx;
		HashMap<EPipelineState, std::unique_ptr<GraphicsPipelineState>> gfx_pso_map;
		HashMap<EPipelineState, std::unique_ptr<ComputePipelineState>>  compute_pso_map;

		enum EPipelineStateType
		{
			Graphics,
			Compute
		};

		inline Shader const& GetShader(EShaderId shader)
		{
			return ShaderCache::GetShader(shader);
		}
		void CreateAllPSOs()
		{
			GraphicsPipelineStateDesc gfx_pso_desc{};
			{
				gfx_pso_desc.root_signature = ERootSignature::Particles_Shading;
				gfx_pso_desc.VS = VS_Particles;
				gfx_pso_desc.PS = PS_Particles;
				gfx_pso_desc.rasterizer_state.cull_mode = ECullMode::None;
				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::SrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::InvSrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_desc.depth_state.depth_enable = false;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::Particles_Shading] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_Skybox), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::Skybox;
				gfx_pso_desc.VS = VS_Skybox;
				gfx_pso_desc.PS = PS_Skybox;
				gfx_pso_desc.rasterizer_state.cull_mode = ECullMode::None;
				gfx_pso_desc.depth_state.depth_enable = TRUE;
				gfx_pso_desc.depth_state.depth_write_mask = EDepthWriteMask::Zero;
				gfx_pso_desc.depth_state.depth_func = EComparisonFunc::LessEqual;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_desc.dsv_format = EFormat::D32_FLOAT;
				gfx_pso_map[EPipelineState::Skybox] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.root_signature = ERootSignature::Sky;
				gfx_pso_desc.PS = PS_UniformColorSky;
				gfx_pso_map[EPipelineState::UniformColorSky] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
				
				gfx_pso_desc.root_signature = ERootSignature::Sky;
				gfx_pso_desc.PS = PS_HosekWilkieSky;
				gfx_pso_map[EPipelineState::HosekWilkieSky] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.root_signature = ERootSignature::TAA;
				gfx_pso_desc.VS = VS_ScreenQuad;
				gfx_pso_desc.PS = PS_Taa;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::TAA] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_GBuffer), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::Common;
				gfx_pso_desc.VS = VS_GBuffer;
				gfx_pso_desc.PS = PS_GBuffer;
				gfx_pso_desc.depth_state.depth_enable = true;
				gfx_pso_desc.depth_state.depth_write_mask = EDepthWriteMask::All;
				gfx_pso_desc.depth_state.depth_func = EComparisonFunc::LessEqual;
				gfx_pso_desc.num_render_targets = 3u;
				gfx_pso_desc.rtv_formats[0] = EFormat::R8G8B8A8_UNORM;
				gfx_pso_desc.rtv_formats[1] = EFormat::R8G8B8A8_UNORM;
				gfx_pso_desc.rtv_formats[2] = EFormat::R8G8B8A8_UNORM;
				gfx_pso_desc.dsv_format = EFormat::D32_FLOAT;
				gfx_pso_map[EPipelineState::GBuffer] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
				gfx_pso_desc.PS = PS_GBuffer_Mask;
				gfx_pso_map[EPipelineState::GBuffer_Mask] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
				gfx_pso_desc.rasterizer_state.cull_mode = ECullMode::None;
				gfx_pso_map[EPipelineState::GBuffer_Mask_NoCull] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
				gfx_pso_desc.PS = PS_GBuffer;
				gfx_pso_map[EPipelineState::GBuffer_NoCull] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				gfx_pso_desc.root_signature = ERootSignature::LightingPBR;
				gfx_pso_desc.VS = VS_ScreenQuad;
				gfx_pso_desc.PS = PS_LightingPBR;
				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::One;
				gfx_pso_desc.depth_state.depth_enable = false;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::LightingPBR] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.PS = PS_LightingPBR_RayTracedShadows;
				gfx_pso_map[EPipelineState::LightingPBR_RayTracedShadows] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.root_signature = ERootSignature::ClusteredLightingPBR;
				gfx_pso_desc.PS = PS_ClusteredLightingPBR;
				gfx_pso_map[EPipelineState::ClusteredLightingPBR] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_DepthMap), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::DepthMap;
				gfx_pso_desc.VS = VS_DepthMap;
				gfx_pso_desc.PS = PS_DepthMap;
				gfx_pso_desc.rasterizer_state.cull_mode = ECullMode::Front;
				gfx_pso_desc.rasterizer_state.fill_mode = EFillMode::Solid;
				gfx_pso_desc.rasterizer_state.depth_bias = 7500;
				gfx_pso_desc.rasterizer_state.depth_bias_clamp = 0.0f;
				gfx_pso_desc.rasterizer_state.slope_scaled_depth_bias = 1.0f;
				gfx_pso_desc.depth_state.depth_enable = true;
				gfx_pso_desc.depth_state.depth_write_mask = EDepthWriteMask::All;
				gfx_pso_desc.depth_state.depth_func = EComparisonFunc::LessEqual;
				gfx_pso_desc.dsv_format = EFormat::D32_FLOAT;
				gfx_pso_map[EPipelineState::DepthMap] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				ShaderCompiler::CreateInputLayout(GetShader(VS_DepthMap_Transparent), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::DepthMap_Transparent;
				gfx_pso_desc.VS = VS_DepthMap_Transparent;
				gfx_pso_desc.PS = PS_DepthMap_Transparent;
				gfx_pso_map[EPipelineState::DepthMap_Transparent] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				gfx_pso_desc.root_signature = ERootSignature::Volumetric;
				gfx_pso_desc.VS = VS_ScreenQuad;
				gfx_pso_desc.PS = PS_Volumetric_Directional;
				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::One;
				gfx_pso_desc.depth_state.depth_enable = false;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::Volumetric_Directional] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.PS = PS_Volumetric_DirectionalCascades;
				gfx_pso_map[EPipelineState::Volumetric_DirectionalCascades] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.PS = PS_Volumetric_Spot;
				gfx_pso_map[EPipelineState::Volumetric_Spot] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

