mateeeeeee/Adria-DX12/Adria/Rendering/PSOCache.cpp
				gfx_pso_desc.PS = PS_Volumetric_Point;
				gfx_pso_map[EPipelineState::Volumetric_Point] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_Sun), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::Forward;
				gfx_pso_desc.VS = VS_Sun;
				gfx_pso_desc.PS = PS_Texture;
				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::SrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::InvSrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_desc.depth_state.depth_enable = true;
				gfx_pso_desc.depth_state.depth_write_mask = EDepthWriteMask::Zero;
				gfx_pso_desc.depth_state.depth_func = EComparisonFunc::LessEqual;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_desc.dsv_format = EFormat::D32_FLOAT;
				gfx_pso_map[EPipelineState::Sun] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				gfx_pso_desc.root_signature = ERootSignature::LensFlare;
				gfx_pso_desc.VS = VS_LensFlare;
				gfx_pso_desc.GS = GS_LensFlare;
				gfx_pso_desc.PS = PS_LensFlare;
				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				
				gfx_pso_desc.topology_type = D3D12_PRIMITIVE_TOPOLOGY_TYPE_POINT;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;

				gfx_pso_map[EPipelineState::LensFlare] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
				
				gfx_pso_desc = {};
				gfx_pso_desc.root_signature = ERootSignature::Copy;
				gfx_pso_desc.VS = VS_ScreenQuad;
				gfx_pso_desc.PS = PS_Copy;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;

				gfx_pso_map[EPipelineState::Copy] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::SrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::InvSrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_map[EPipelineState::Copy_AlphaBlend] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_map[EPipelineState::Copy_AdditiveBlend] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
				
				gfx_pso_desc = {};
				gfx_pso_desc.root_signature = ERootSignature::Add;
				gfx_pso_desc.VS = VS_ScreenQuad;
				gfx_pso_desc.PS = PS_Add;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::Add] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::SrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::InvSrcAlpha;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_map[EPipelineState::Add_AlphaBlend] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				gfx_pso_map[EPipelineState::Add_AdditiveBlend] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};	
				gfx_pso_desc.root_signature = ERootSignature::Bokeh;
				gfx_pso_desc.VS = VS_Bokeh;
				gfx_pso_desc.GS = GS_Bokeh;
				gfx_pso_desc.PS = PS_Bokeh;
				gfx_pso_desc.blend_state.render_target[0].blend_enable = true;
				gfx_pso_desc.blend_state.render_target[0].src_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].dest_blend = EBlend::One;
				gfx_pso_desc.blend_state.render_target[0].blend_op = EBlendOp::Add;
				
				gfx_pso_desc.topology_type = D3D12_PRIMITIVE_TOPOLOGY_TYPE_POINT;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::Bokeh] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
				
				gfx_pso_desc = {};
				gfx_pso_desc.root_signature = ERootSignature::Clouds;
				gfx_pso_desc.VS = VS_ScreenQuad;
				gfx_pso_desc.PS = PS_VolumetricClouds;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::Clouds] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_Ocean), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::Ocean;
				gfx_pso_desc.VS = VS_Ocean;
				gfx_pso_desc.PS = PS_Ocean;
				gfx_pso_desc.depth_state.depth_enable = true;
				gfx_pso_desc.depth_state.depth_write_mask = EDepthWriteMask::All;
				gfx_pso_desc.depth_state.depth_func = EComparisonFunc::LessEqual;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_desc.dsv_format = EFormat::D32_FLOAT;
				gfx_pso_map[EPipelineState::Ocean] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.rasterizer_state.fill_mode = EFillMode::Wireframe;
				gfx_pso_map[EPipelineState::Ocean_Wireframe] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

