mateeeeeee/Adria-DX12/Adria/Rendering/PSOCache.cpp
				gfx_pso_desc.root_signature = ERootSignature::OceanLOD;
				gfx_pso_desc.VS = VS_OceanLOD;
				gfx_pso_desc.DS = DS_OceanLOD;
				gfx_pso_desc.HS = HS_OceanLOD;
				gfx_pso_desc.topology_type = D3D12_PRIMITIVE_TOPOLOGY_TYPE_PATCH;
				gfx_pso_map[EPipelineState::OceanLOD_Wireframe] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.rasterizer_state.fill_mode = EFillMode::Solid;
				gfx_pso_map[EPipelineState::OceanLOD] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_Decals), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::Decals;
				gfx_pso_desc.VS = VS_Decals;
				gfx_pso_desc.PS = PS_Decals;
				gfx_pso_desc.rasterizer_state.cull_mode = ECullMode::None;
				gfx_pso_desc.depth_state.depth_enable = FALSE;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R8G8B8A8_UNORM;
				gfx_pso_map[EPipelineState::Decals] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.PS = PS_Decals_ModifyNormals;
				gfx_pso_desc.num_render_targets = 2;
				gfx_pso_desc.rtv_formats[1] = EFormat::R8G8B8A8_UNORM;
				gfx_pso_map[EPipelineState::Decals_ModifyNormals] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_Solid), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::Forward;
				gfx_pso_desc.VS = VS_Solid;
				gfx_pso_desc.PS = PS_Solid;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::Solid] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc.depth_state.depth_enable = false;
				gfx_pso_desc.rasterizer_state.fill_mode = EFillMode::Wireframe;
				gfx_pso_desc.topology_type = D3D12_PRIMITIVE_TOPOLOGY_TYPE_LINE;
				gfx_pso_map[EPipelineState::Solid_Wireframe] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);

				gfx_pso_desc = {};
				ShaderCompiler::CreateInputLayout(GetShader(VS_Texture), gfx_pso_desc.input_layout);
				gfx_pso_desc.root_signature = ERootSignature::Forward;
				gfx_pso_desc.VS = VS_Texture;
				gfx_pso_desc.PS = PS_Texture;
				gfx_pso_desc.num_render_targets = 1;
				gfx_pso_desc.rtv_formats[0] = EFormat::R16G16B16A16_FLOAT;
				gfx_pso_map[EPipelineState::Texture] = std::make_unique<GraphicsPipelineState>(gfx, gfx_pso_desc);
			}

			ComputePipelineStateDesc compute_pso_desc{};
			{
				compute_pso_desc.root_signature = ERootSignature::Picker;
				compute_pso_desc.CS = CS_Picker;
				compute_pso_map[EPipelineState::Picker] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Particles_InitDeadList;
				compute_pso_desc.CS = CS_ParticleInitDeadList;
				compute_pso_map[EPipelineState::Particles_InitDeadList] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Particles_Reset;
				compute_pso_desc.CS = CS_ParticleReset;

				compute_pso_desc.root_signature = ERootSignature::Particles_Simulate;
				compute_pso_desc.CS = CS_ParticleSimulate;
				compute_pso_map[EPipelineState::Particles_Simulate] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Particles_Emit;
				compute_pso_desc.CS = CS_ParticleEmit;
				compute_pso_map[EPipelineState::Particles_Emit] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Particles_InitSortDispatchArgs;
				compute_pso_desc.CS = CS_ParticleInitSortDispatchArgs;
				compute_pso_map[EPipelineState::Particles_InitSortDispatchArgs] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Particles_Sort;
				compute_pso_desc.CS = CS_ParticleBitonicSortStep;
				compute_pso_map[EPipelineState::Particles_BitonicSortStep] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.CS = CS_ParticleSort512;
				compute_pso_map[EPipelineState::Particles_Sort512] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.CS = CS_ParticleSortInner512;
				compute_pso_map[EPipelineState::Particles_SortInner512] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::ClusterBuilding;
				compute_pso_desc.CS = CS_ClusterBuilding;
				compute_pso_map[EPipelineState::ClusterBuilding] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::ClusterCulling;
				compute_pso_desc.CS = CS_ClusterCulling;
				compute_pso_map[EPipelineState::ClusterCulling] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::TiledLighting;
				compute_pso_desc.CS = CS_TiledLighting;
				compute_pso_map[EPipelineState::TiledLighting] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Blur;
				compute_pso_desc.CS = CS_Blur_Horizontal;
				compute_pso_map[EPipelineState::Blur_Horizontal] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.CS = CS_Blur_Vertical;
				compute_pso_map[EPipelineState::Blur_Vertical] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::BloomExtract;
				compute_pso_desc.CS = CS_BloomExtract;
				compute_pso_map[EPipelineState::BloomExtract] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::BloomCombine;
				compute_pso_desc.CS = CS_BloomCombine;
				compute_pso_map[EPipelineState::BloomCombine] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::GenerateMips;
				compute_pso_desc.CS = CS_GenerateMips;
				compute_pso_map[EPipelineState::GenerateMips] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

