mateeeeeee/Adria-DX12/Adria/Rendering/PSOCache.cpp
				compute_pso_desc.root_signature = ERootSignature::BokehGenerate;
				compute_pso_desc.CS = CS_BokehGenerate;
				compute_pso_map[EPipelineState::BokehGenerate] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::FFT;
				compute_pso_desc.CS = CS_FFT_Horizontal;
				compute_pso_map[EPipelineState::FFT_Horizontal] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.CS = CS_FFT_Vertical;
				compute_pso_map[EPipelineState::FFT_Vertical] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::InitialSpectrum;
				compute_pso_desc.CS = CS_InitialSpectrum;
				compute_pso_map[EPipelineState::InitialSpectrum] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::InitialSpectrum;
				compute_pso_desc.CS = CS_InitialSpectrum;
				compute_pso_map[EPipelineState::InitialSpectrum] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::OceanNormalMap;
				compute_pso_desc.CS = CS_OceanNormalMap;
				compute_pso_map[EPipelineState::OceanNormalMap] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Phase;
				compute_pso_desc.CS = CS_Phase;
				compute_pso_map[EPipelineState::Phase] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Spectrum;
				compute_pso_desc.CS = CS_Spectrum;
				compute_pso_map[EPipelineState::Spectrum] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_BuildHistogram;
				compute_pso_map[EPipelineState::BuildHistogram] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_HistogramReduction;
				compute_pso_map[EPipelineState::HistogramReduction] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Exposure;
				compute_pso_map[EPipelineState::Exposure] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Ssao;
				compute_pso_map[EPipelineState::SSAO] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Hbao;
				compute_pso_map[EPipelineState::HBAO] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Ssr;
				compute_pso_map[EPipelineState::SSR] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Fog;
				compute_pso_map[EPipelineState::Fog] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Tonemap;
				compute_pso_map[EPipelineState::ToneMap] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_MotionVectors;
				compute_pso_map[EPipelineState::MotionVectors] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_MotionBlur;
				compute_pso_map[EPipelineState::MotionBlur] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Dof;
				compute_pso_map[EPipelineState::DOF] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_GodRays;
				compute_pso_map[EPipelineState::GodRays] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Fxaa;
				compute_pso_map[EPipelineState::FXAA] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);

				compute_pso_desc.root_signature = ERootSignature::Common;
				compute_pso_desc.CS = CS_Ambient;
				compute_pso_map[EPipelineState::Ambient] = std::make_unique<ComputePipelineState>(gfx, compute_pso_desc);
			}
		}
	}

	void PSOCache::Initialize(GraphicsDevice* _gfx)
	{
		gfx = _gfx;
		CreateAllPSOs();
	}

	void PSOCache::Destroy()
	{
		gfx_pso_map.clear();
		compute_pso_map.clear();
	}

	ID3D12PipelineState* PSOCache::Get(EPipelineState ps)
	{
		if (compute_pso_map.contains(ps)) return *compute_pso_map[ps];
		else return *gfx_pso_map[ps];
	}
}

